In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [4]:
df1 = pd.DataFrame({'key': ['foo', 'bar', 'baz', 'foo'],'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'key': ['foo', 'bar', 'baz', 'foo'],'value': [5, 6, 7, 8]})

In [7]:
df1.merge(df2, on=['key'], copy=False)

   key  value_x  value_y
0  foo        1        5
1  foo        1        8
2  foo        5        5
3  foo        5        8
4  bar        2        6
5  baz        3        7

In [8]:
df1

   key  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [10]:
df1.value.max()

5